In [4]:
import pandas as pd
import numpy as np

In [5]:
from sqlalchemy import create_engine

In [6]:
temp_db = create_engine('sqlite:///:memory:')

In [12]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)), columns=['a','b','c','d'])

In [13]:
df

    a   b   c   d
0  92   7  47  87
1  35  45  92  50
2   8  50  80   3
3  14  43  81  66

In [14]:
df.to_sql(name='new_table', con=temp_db)

4

In [16]:
#df.to_sql(name='new_table', con=temp_db)

In [18]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [19]:
new_df

   index   a   b   c   d
0      0  92   7  47  87
1      1  35  45  92  50
2      2   8  50  80   3
3      3  14  43  81  66

In [23]:
result = pd.read_sql_query(sql="SELECT a,c from new_table", con=temp_db)

In [24]:
result

    a   c
0  92  47
1  35  92
2   8  80
3  14  81